UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ЗагрузкаПервоначальныхОстатков/рар_мп_ЗагрузкаПервоначальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_ЗагрузкаПервоначальныхОстатков</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="89c3c225-6452-47bf-bc47-e4896b800c53">
  <name>СистемыНалогообложения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="dd4329a2-18e7-4963-afc8-862868f583ff">
    <name>Общая</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="223e730f-4f2a-4f41-ab2f-9fa9a5b3f485">
    <name>Упрощенная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/МетодыОценкиСтоимостиТоваров/МетодыОценкиСтоимостиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c3bd563-cd82-4681-ac6a-9837b806dcf9">
  <name>МетодыОценкиСтоимостиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a86a3183-7b62-4435-a3b3-c0f9685aa7ab">
    <name>СредняяЗаМесяц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="357beecd-4241-4857-a6ee-86a81d043875">
    <name>ФИФОВзвешеннаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="96bb45fa-a724-48ee-b5d8-311831f9ee1b">
    <name>ФИФОСкользящаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/НастройкиАдресногоХранения/НастройкиАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7a37f9be-6092-4e0d-aab0-c7994229d110">
  <name>НастройкиАдресногоХранения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="547ae60a-335d-4529-8a04-c07afb777818">
    <name>ОпределяетсяНастройкамиПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ee67d3ea-8ef0-4319-ad37-83a152d02237">
    <name>ЯчейкиОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/ИспользованиеСкладскихРабочихУчастков/ИспользованиеСкладскихРабочихУчастков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="99acb177-461e-4f89-aea3-0fffd1ca2f23">
  <name>ИспользованиеСкладскихРабочихУчастков</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f459e67e-cf42-4daf-9244-741825d76ad5">
    <name>Использовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СхемыРаботы/рар_мп_СхемыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СхемыРаботы</name>
  <enumValues>
    <name>FBS</name>
  </enumValues>
  <enumValues>
    <name>FBO</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ЗагрузкаПервоначальныхОстатков/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	Иначе
		АккаунтМаркетплейсаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АккаунтМаркетплейсаПриИзменении(Элемент)
	
	СписокНоменклатуры.Очистить();
	
	АккаунтМаркетплейсаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АккаунтМаркетплейсаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(АккаунтМаркетплейса) Тогда
		Организация = АккаунтМаркетплейса.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Склад 					= Справочники.Склады.ПустаяСсылка();
	Помещение 				= Справочники.СкладскиеПомещения.ПустаяСсылка();
	ЗонаПриемки 			= Справочники.СкладскиеЯчейки.ПустаяСсылка();
	Партия					= Документы.ПервичныйДокумент.ПустаяСсылка();
	ОстаткиПодДеятельность 	= Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка();
	ВводОстатков 			= Документы.ВводОстатков.ПустаяСсылка();
	
	СистемаНалогообложения = УчетнаяПолитикаПереопределяемый.СистемаНалогообложения(Организация, ТекущаяДата());
	ИспользуетсяПСН = УчетнаяПолитикаПереопределяемый.ПрименяетсяПСН(Организация, ТекущаяДата());
	
	Если ИспользуетсяПСН И СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		Элементы.ОстаткиПодДеятельность.Видимость = Истина;
		
		ПараметрыЗаполненияВидаДеятельности = ЗаполнитьПараметрыЗаполненияВидаДеятельности();
		
		УчетНДСУП.ЗаполнитьСписокВыбораВидаДеятельностиНДС(Элементы.ОстаткиПодДеятельность, ОстаткиПодДеятельность, ПараметрыЗаполненияВидаДеятельности);
	Иначе
		Элементы.ОстаткиПодДеятельность.Видимость = Ложь;
	КонецЕсли;
	
	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("УчетнаяПолитикаФинансовогоУчета",
		Организация,
		НачалоМесяца(ТекущаяДата()));
		
	Если ПараметрыУчетнойПолитики <> Неопределено Тогда
		МетодОценкиСтоимости = ПараметрыУчетнойПолитики.МетодОценкиСтоимостиТоваров;
	КонецЕсли;
	
	Если МетодОценкиСтоимости = Перечисления.МетодыОценкиСтоимостиТоваров.СредняяЗаМесяц Тогда
		Элементы.Партия.Видимость = Ложь;
	Иначе
		Элементы.Партия.Видимость = Истина;
	КонецЕсли;
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Элементы.СписокНоменклатурыБаракод.Видимость 	= Истина;
		
		Элементы.СписокНоменклатурыSKUТовара.Видимость 	= Ложь; 
		Элементы.СписокНоменклатурыIDТовара.Видимость	= Ложь;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Элементы.СписокНоменклатурыIDТовара.Видимость	= Истина;
		Элементы.СписокНоменклатурыSKUТовара.Видимость 	= Истина;
		
		Элементы.СписокНоменклатурыБаракод.Видимость 	= Ложь;
				
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Элементы.СписокНоменклатурыSKUТовара.Видимость 	= Истина;
		
		Элементы.СписокНоменклатурыБаракод.Видимость 	= Ложь;
		Элементы.СписокНоменклатурыIDТовара.Видимость	= Ложь;
		
	КонецЕсли;
	
	СброситьРеквизитыЗагрузки();
	
	Если ЗначениеЗаполнено(АккаунтМаркетплейса) Тогда
		Элементы.ГруппаДанныеЗагрузки.Видимость = Истина;
	Иначе
		Элементы.ГруппаДанныеЗагрузки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	Если Не ПроверитьУсловиеВыбораСклада() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АккаунтМаркетплейса", АккаунтМаркетплейса); 
		ОткрытьФорму("ОбщаяФорма.рар_мп_ФормаВыбораСопоставленныхСкладов", ПараметрыФормы, Элементы.Склад);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Не ПроверитьУсловиеВыбораСклада() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Склад = ВыбранноеЗначение.Склад;
		campaignID = ВыбранноеЗначение.campaignID;
		
		СписокНоменклатуры.Очистить();
		
		СкладПриИзмененииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СписокНоменклатуры.Очистить();
	
	СкладПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	Помещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
	
	Если Склад.ИспользоватьСкладскиеПомещения Тогда
		Элементы.Помещение.Видимость = Истина;
	Иначе
		Элементы.Помещение.Видимость = Ложь;
	КонецЕсли;
	
	ЗонаПриемки = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	Если Склад.НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.ЯчейкиОстатки Тогда
		Элементы.ЗонаПриемки.Видимость = Истина;
	Иначе
		Элементы.ЗонаПриемки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПомещениеПриИзмененииНаСервере()
	
	ЗонаПриемки = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	Если Помещение.ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать Тогда
		Элементы.ЗонаПриемки.Видимость = Истина;
	Иначе
		Элементы.ЗонаПриемки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	ПомещениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидЗагрузкиОстатковПриИзмененииНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	ПутьКФайлуОстатков = "";
	
	ВидЗагрузкиЦен 				= "";
	ПутьКФайлуЦен 				= "";
	ВидЦены 					= Справочники.ВидыЦен.ПустаяСсылка();
	НомерКолонкиSKUТовараЦены 	= 0;
	НомерКолонкиБаракодЦены 	= 0;
	НомерКолонкиЦена 			= 0;
	НачальнаяСтрокаЦен			= 0;
	
	Элементы.ПутьКФайлуЦен.Видимость 	= Ложь;
	Элементы.ВидЦены.Видимость			= Ложь;
	Элементы.ГруппаКолонкиЦен.Видимость = Ложь;
	
	Если ВидЗагрузкиОстатков = "Excel" Тогда
		
		Элементы.ПутьКФайлуОстатков.Видимость = Истина;
		
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Очистить();
		
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Добавить("ВидЦен", 			"По виду цены");
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Добавить("ОтдельныйExcel", 	"Из отдельного Excel файла");
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Добавить("СовместныйExcel", 	"Из Excel файла остатков");
			
		Элементы.ГруппаКолонкиОстатков.Видимость = Истина;
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Элементы.НомерКолонкиБаракодОстатков.Видимость 		= Истина;
			
			Элементы.НомерКолонкиSKUТовараОстатков.Видимость 	= Ложь;
			Элементы.НомерКолонкиIDТовара.Видимость				= Ложь;
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
			
			Элементы.НомерКолонкиSKUТовараОстатков.Видимость 	= Истина;
			Элементы.НомерКолонкиIDТовара.Видимость				= Истина;
			
			Элементы.НомерКолонкиБаракодОстатков.Видимость 		= Ложь;
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			
			Элементы.НомерКолонкиSKUТовараОстатков.Видимость 	= Истина;
			
			Элементы.НомерКолонкиБаракодОстатков.Видимость 		= Ложь;
			Элементы.НомерКолонкиIDТовара.Видимость				= Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ВидЗагрузкиОстатков = "API" Тогда
		
		Элементы.ПутьКФайлуОстатков.Видимость 		= Ложь;
		Элементы.ГруппаКолонкиОстатков.Видимость 	= Ложь;
		
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Очистить();
		
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Добавить("ВидЦен", 			"По виду цены");
		Элементы.ВидЗагрузкиЦен.СписокВыбора.Добавить("ОтдельныйExcel", 	"Из Excel файла");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗагрузкиОстатковПриИзменении(Элемент)
	ВидЗагрузкиОстатковПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидЗагрузкиЦенПриИзмененииНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	ПутьКФайлуЦен 	= "";
	ВидЦены 		= Справочники.ВидыЦен.ПустаяСсылка();
	
	Если ВидЗагрузкиЦен = "ВидЦен" Тогда
		
		Элементы.ВидЦены.Видимость 			= Истина;
		
		Элементы.ПутьКФайлуЦен.Видимость 	= Ложь;
		Элементы.ГруппаКолонкиЦен.Видимость = Ложь;
		
	ИначеЕсли ВидЗагрузкиЦен = "ОтдельныйExcel" Тогда
		
		Элементы.ПутьКФайлуЦен.Видимость 	= Истина;
		
		Элементы.ВидЦены.Видимость 			= Ложь;
		
		Элементы.ГруппаКолонкиЦен.Видимость = Истина;
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Элементы.НомерКолонкиБаракодЦены.Видимость 		= Истина;
			
			Элементы.НомерКолонкиSKUТовараЦены.Видимость 	= Ложь;
			Элементы.НомерКолонкиБаракодЦены.ТолькоПросмотр = Ложь;
			
		Иначе
			
			Элементы.НомерКолонкиSKUТовараЦены.Видимость 		= Истина;
			
			Элементы.НомерКолонкиБаракодЦены.Видимость 			= Ложь;
			Элементы.НомерКолонкиSKUТовараЦены.ТолькоПросмотр 	= Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ВидЗагрузкиЦен = "СовместныйExcel" Тогда
		
		Элементы.ВидЦены.Видимость 			= Ложь;
		
		Элементы.ПутьКФайлуЦен.Видимость 	= Ложь;
		
		Если ЗначениеЗаполнено(Маркетплейс) Тогда
			
			Элементы.ГруппаКолонкиЦен.Видимость = Истина;
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				Элементы.НомерКолонкиБаракодЦены.Видимость 		= Истина;
				Элементы.НомерКолонкиБаракодЦены.ТолькоПросмотр = Истина;
				Элементы.НачальнаяСтрокаЦен.ТолькоПросмотр		= Истина;
				
				Элементы.НомерКолонкиSKUТовараЦены.Видимость 	= Ложь;
				
				НомерКолонкиБаракодЦены 	= НомерКолонкиБаракодОстатков;
				НачальнаяСтрокаЦен 			= НачальнаяСтрокаОстатков;
				
			Иначе
				
				Элементы.НомерКолонкиSKUТовараЦены.Видимость 		= Истина;
				Элементы.НомерКолонкиSKUТовараЦены.ТолькоПросмотр 	= Истина;
				Элементы.НачальнаяСтрокаЦен.ТолькоПросмотр		= Истина;
				
				Элементы.НомерКолонкиБаракодЦены.Видимость 			= Ложь;
				
				НомерКолонкиSKUТовараЦены 	= НомерКолонкиSKUТовараОстатков;
				НачальнаяСтрокаЦен 			= НачальнаяСтрокаОстатков;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗагрузкиЦенПриИзменении(Элемент)
	ВидЗагрузкиЦенПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиSKUТовараОстатковПриИзменении(Элемент)
	
	Если ВидЗагрузкиЦен = "СовместныйExcel" Тогда
		НомерКолонкиSKUТовараЦены = НомерКолонкиSKUТовараОстатков;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиБаракодОстатковПриИзменении(Элемент)
	
	Если ВидЗагрузкиЦен = "СовместныйExcel" Тогда
		НомерКолонкиБаракодЦены = НомерКолонкиБаракодОстатков;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяСтрокаОстатковПриИзменении(Элемент)
	
	Если ВидЗагрузкиЦен = "СовместныйExcel" Тогда
		НачальнаяСтрокаЦен = НачальнаяСтрокаОстатков;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОстатковНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Обработчик = Новый ОписаниеОповещения("КаталогДокументовОстатковЗавершение", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Excel'; en = 'Excel'") + "(*.xls, *.xlsx)|*.xl*";
	ПараметрыДиалога.ИндексФильтра = 0;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'");
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Обработчик, ПараметрыДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовОстатковЗавершение(ИмяКаталогаДокументов, ДополнительныеПараметры) Экспорт   
	Если ИмяКаталогаДокументов <> НЕОПРЕДЕЛЕНО Тогда	   
		ПутьКФайлуОстатков = ИмяКаталогаДокументов[0];
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуЦенНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Обработчик = Новый ОписаниеОповещения("КаталогДокументовЦенЗавершение", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Excel'; en = 'Excel'") + "(*.xls, *.xlsx)|*.xl*";
	ПараметрыДиалога.ИндексФильтра = 0;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'");
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Обработчик, ПараметрыДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовЦенЗавершение(ИмяКаталогаДокументов, ДополнительныеПараметры) Экспорт   
	Если ИмяКаталогаДокументов <> НЕОПРЕДЕЛЕНО Тогда	   
		ПутьКФайлуЦен = ИмяКаталогаДокументов[0];
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

&НаКлиенте
Асинх Процедура ЗагрузитьНоменклатуру(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		СписокНоменклатуры.Очистить();
		
		//Проверяем вид загрузки остатков и реквизиты
		Если Не ПроверитьРеквизитыОстатков() Тогда
			Возврат;
		КонецЕсли;
		
		ПутьКФайлу = "";
		
		Если ВидЗагрузкиОстатков = "Excel" Тогда
			
			Файл = Ждать СоздатьДвоичныеДанныеИзФайлаАсинх(ПутьКФайлуОстатков);
			
			ПутьКФайлу = ПолучитьФайлПриемник(Файл);
			
		КонецЕсли;
		
		ДлительнаяОперация = СформироватьТаблицуНаСервере(ПутьКФайлу);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение данных по остаткам...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузки", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНаСервере(ПутьКФайлу)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	МассивНомеровКолонок = Новый Массив;
	
	ЗаполнитьМассивКолонок(Маркетплейс, МассивНомеровКолонок, "Остатки");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"рар_мп_ЗагрузкаПервоначальныхОстатков.ПолучитьКоличествоТоваров_Wildberries", 
			АккаунтМаркетплейса, Склад, ВидЗагрузкиОстатков, ПутьКФайлу, МассивНомеровКолонок, НачальнаяСтрокаОстатков);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"рар_мп_ЗагрузкаПервоначальныхОстатков.ПолучитьКоличествоТоваров_Ozon", 
			АккаунтМаркетплейса, Склад, ВидЗагрузкиОстатков, ПутьКФайлу, МассивНомеровКолонок, НачальнаяСтрокаОстатков);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"рар_мп_ЗагрузкаПервоначальныхОстатков.ПолучитьКоличествоТоваров_ЯндексМаркет", 
			АккаунтМаркетплейса, campaignId, ВидЗагрузкиОстатков, ПутьКФайлу, МассивНомеровКолонок, НачальнаяСтрокаОстатков);
		
	КонецЕсли;
			
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗагрузки(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ЗавершениеЗагрузкиОшибкаНаСервере();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗагрузкиНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
		
		СписокНоменклатуры.Загрузить(ТЗ);
		
		Если СписокНоменклатуры.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для данного аккаунта нет данных об остатках";
			Сообщение.Сообщить();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Загрузка завершена";
			Сообщение.Сообщить();
		КонецЕсли
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке данных. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке данных в табличную часть", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаЦенНоменклатуры

&НаКлиенте
Асинх Процедура ЗагрузитьЦенуНоменклатуры(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		//Проверяем реквизиты цен
		Если Не ПроверитьРеквизитыЦен() Тогда
			Возврат;
		КонецЕсли;
		
		Если СписокНоменклатуры.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Таблица товаров пуста";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		ПутьКФайлу = "";
		
		Если ВидЗагрузкиЦен = "ОтдельныйExcel" Тогда
			
			Файл = Ждать СоздатьДвоичныеДанныеИзФайлаАсинх(ПутьКФайлуЦен);
			
			ПутьКФайлу = ПолучитьФайлПриемник(Файл);
			
		ИначеЕсли ВидЗагрузкиЦен = "СовместныйExcel" Тогда
			
			Файл = Ждать СоздатьДвоичныеДанныеИзФайлаАсинх(ПутьКФайлуОстатков);
			
			ПутьКФайлу = ПолучитьФайлПриемник(Файл);
			
		КонецЕсли;
		
		ДлительнаяОперация = СформироватьТаблицуЦенНаСервере(ПутьКФайлу);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение данных по ценам...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиЦен", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуЦенНаСервере(ПутьКФайлу)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	МассивНомеровКолонок = Новый Массив;
	
	ЗаполнитьМассивКолонок(Маркетплейс, МассивНомеровКолонок, "Цены", ВидЗагрузкиЦен);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
							"рар_мп_ЗагрузкаПервоначальныхОстатков.ПолучитьЦеныТоваров_Общая", 
							АккаунтМаркетплейса, СписокНоменклатуры.Выгрузить(), ВидЗагрузкиЦен, ВидЦены, ПутьКФайлу, МассивНомеровКолонок, НачальнаяСтрокаЦен);
	
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗагрузкиЦен(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиЦенНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ЗавершениеЗагрузкиОшибкаНаСервере();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗагрузкиЦенНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
		
		СписокНоменклатуры.Загрузить(ТЗ);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка завершена";
		Сообщение.Сообщить();
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке данных. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке данных в табличную часть", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументаПервоначальныхОстатков

&НаСервере
Процедура СформироватьДокументНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		
		Если СписокНоменклатуры.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Таблица пустая";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВводОстатков) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ первоначальных остатков уже создан";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		Если Не ПроверитьРеквизиты() Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПроверитьНоменклатуру() Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПроверитьЗаполнениеЦен() Тогда
			Возврат;
		КонецЕсли;
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
		
		ВводОстатков = рар_мп_ЗагрузкаПервоначальныхОстатков.СоздатьВводПервоначальныхОстатков(
								СписокНоменклатуры, АккаунтМаркетплейса, Партия, ОстаткиПодДеятельность, Склад, Помещение, ЗонаПриемки);
								
		ДокОстатковЗаполнениеПолей(ВводОстатков);  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокумент(Команда)
	СформироватьДокументНаСервере();
КонецПроцедуры

#КонецОбласти     

#Область СозданиеДокументаПервоначальныхВзаиморасчетов

&НаСервере
Процедура СформироватьДокВзаиморасчетыНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
				
		Если ЗначениеЗаполнено(ВводВзаиморасчетов) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ первоначальных взаиморасчетов уже создан";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		Если Взаиморасчеты.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Таблица пустая";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		Для Каждого Строка Из Взаиморасчеты Цикл
			
			Если Не ЗначениеЗаполнено(Строка.Сумма_ВР) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Отсутствует сумма (строка №%1)", Строка.НомерСтроки);
				Сообщение.Сообщить();
				
				ОтсутствуетНоменклатура = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Взаиморасчеты.Итог("Сумма_ВР") <> СуммаДокОстатков Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сумма табличной части отличается от суммы документа ввода остатков номенклатуры";
			Сообщение.Сообщить();
			
			Возврат;
	
		КонецЕсли;
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
		
		ВводВзаиморасчетов = рар_мп_ЗагрузкаПервоначальныхОстатков.СоздатьВводПервоначальныхВзаиморасчетов(
								Взаиморасчеты, АккаунтМаркетплейса, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокВзаиморасчеты(Команда) 
	
	Если ДокОстатковНоменклатуры.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Отсутствует документ ввода остатков номенклатуры");
		Сообщение.Сообщить();
		
	Иначе
		
		СформироватьДокВзаиморасчетыНаСервере(); 
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьЗаполнениеЦен()
	
	ЦеныЗаполнены = Истина;
	
	Для Каждого Строка Из СписокНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Цена) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не указана цена у номенклатуры (строка %1)", Строка.НомерСтроки);
			Сообщение.Сообщить();
			
			ЦеныЗаполнены = Ложь;;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ЦеныЗаполнены;
	
КонецФункции

&НаСервере
Функция ПроверитьНоменклатуру()
	
	ОтсутствуетНоменклатура = Ложь;
	
	Для Каждого Строка Из СписокНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Отсутствует сопоставленная номенклатура (строка №%1)", Строка.НомерСтроки);
			Сообщение.Сообщить();
			
			ОтсутствуетНоменклатура = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтсутствуетНоменклатура Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось создать ввод первоначальных остатков, так как в таблице отсутствует сопоставленная номенклатура";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьРеквизиты()
	
	РеквизитыЗаполнены = Истина;
	
	Если Элементы.Помещение.Видимость = Истина Тогда
		Если Не ЗначениеЗаполнено(Помещение) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите помещение";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ЗонаПриемки.Видимость = Истина Тогда
		Если Не ЗначениеЗаполнено(ЗонаПриемки) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите зону приемки";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.Партия.Видимость = Истина Тогда
		Если Не ЗначениеЗаполнено(Партия) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите партию";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ОстаткиПодДеятельность.Видимость = Истина Тогда
		Если Не ЗначениеЗаполнено(ОстаткиПодДеятельность) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите остатки под деятельность";
			Сообщение.Сообщить();
			
			РеквизитыЗаполнены = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитыЗаполнены;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПараметрыЗаполненияВидаДеятельности()
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияВидаДеятельностиНДС();
	ПараметрыЗаполнения.Организация             = Организация;
	ПараметрыЗаполнения.Дата                    = ТекущаяДата();
	ПараметрыЗаполнения.Склад                   = Склад;
	ПараметрыЗаполнения.Договор                 = АккаунтМаркетплейса.Договор;
	ПараметрыЗаполнения.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	ПараметрыЗаполнения.ПриобретениеТоваров     = Истина;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервере
Функция ПроверитьРеквизитыОстатков()
	
	Если ЗначениеЗаполнено(ВидЗагрузкиОстатков) Тогда
		
		Если ВидЗагрузкиОстатков = "API" Тогда
			
			Возврат Истина;
			
		ИначеЕсли ВидЗагрузкиОстатков = "Excel" Тогда
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			РеквизитыЗаполнены = Истина;
			
			Если Не ЗначениеЗаполнено(ПутьКФайлуОстатков) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите путь к файлу остатков";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				Если НомерКолонкиБаракодОстатков = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""Баракод""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				Если НомерКолонкиIDТовара = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""ID товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
				Если НомерКолонкиSKUТовараОстатков = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				Если НомерКолонкиSKUТовараОстатков = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НомерКолонкиКоличество = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите номер колонки ""Количество""";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Возврат РеквизитыЗаполнены;
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите вид загрузки товаров";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПроверитьРеквизитыЦен()
	
	Если ЗначениеЗаполнено(ВидЗагрузкиЦен) Тогда
		
		Если ВидЗагрузкиЦен = "ВидЦен" Тогда
			
			Если Не ЗначениеЗаполнено(ВидЦены) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите вид цены";
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			КонецЕсли;
			
			Возврат Истина;
			
		ИначеЕсли ВидЗагрузкиЦен = "ОтдельныйExcel" Тогда
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			РеквизитыЗаполнены = Истина;
			
			Если Не ЗначениеЗаполнено(ПутьКФайлуЦен) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите путь к файлу цен";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				Если НомерКолонкиБаракодЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""Баракод""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				Если НомерКолонкиSKUТовараЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				Если НомерКолонкиSKUТовараЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НомерКолонкиЦена = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите номер колонки ""Цена""";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Возврат РеквизитыЗаполнены;
			
		ИначеЕсли ВидЗагрузкиЦен = "СовместныйExcel" Тогда
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			РеквизитыЗаполнены = Истина;
			
			Если Не ЗначениеЗаполнено(ПутьКФайлуОстатков) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите путь к файлу остатков";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				Если НомерКолонкиБаракодЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""Баракод""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				Если НомерКолонкиSKUТовараЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				Если НомерКолонкиSKUТовараЦены = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Укажите номер колонки ""SKU товара""";
					Сообщение.Сообщить();
					
					РеквизитыЗаполнены = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НомерКолонкиЦена = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Укажите номер колонки ""Цена""";
				Сообщение.Сообщить();
				
				РеквизитыЗаполнены = Ложь;
				
			КонецЕсли;
			
			Возврат РеквизитыЗаполнены;
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите вид загрузки цен";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура СброситьРеквизитыЗагрузки()
	
	ВидЗагрузкиОстатков 			= "";
	ПутьКФайлуОстатков 				= "";
	НомерКолонкиIDТовара 			= 0;
	НомерКолонкиSKUТовараОстатков 	= 0;
	НомерКолонкиБаракодОстатков 	= 0;
	НомерКолонкиКоличество 			= 0;
	НачальнаяСтрокаОстатков			= 0;
	
	ВидЗагрузкиЦен 				= "";
	ПутьКФайлуЦен 				= "";
	ВидЦены 					= Справочники.ВидыЦен.ПустаяСсылка();
	НомерКолонкиSKUТовараЦены 	= 0;
	НомерКолонкиБаракодЦены 	= 0;
	НомерКолонкиЦена 			= 0;
	НачальнаяСтрокаЦен			= 0;
	
	Элементы.ГруппаКолонкиОстатков.Видимость 	= Ложь;
	Элементы.ГруппаКолонкиЦен.Видимость 		= Ложь;
	Элементы.ПутьКФайлуОстатков.Видимость		= Ложь;
	Элементы.ПутьКФайлуЦен.Видимость			= Ложь;
	Элементы.ВидЦены.Видимость					= Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивКолонок(Маркетплейс, МассивНомеровКолонок, ТипЗагрузки, ВидЗагрузкиЦен = "")
	
	Если ТипЗагрузки = "Остатки" Тогда
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			МассивНомеровКолонок.Добавить(НомерКолонкиБаракодОстатков);
			МассивНомеровКолонок.Добавить(НомерКолонкиКоличество);
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			
			МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараОстатков);
			МассивНомеровКолонок.Добавить(НомерКолонкиКоличество);
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
			
			МассивНомеровКолонок.Добавить(НомерКолонкиIDТовара);
			МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараОстатков);
			МассивНомеровКолонок.Добавить(НомерКолонкиКоличество);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗагрузки = "Цены" Тогда
		
		Если ВидЗагрузкиЦен = "ОтдельныйExcel" Тогда
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиБаракодЦены);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараЦены);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараЦены);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			КонецЕсли;
			
		ИначеЕсли ВидЗагрузкиЦен = "СовместныйExcel" Тогда
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиБаракодОстатков);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараОстатков);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
				
				МассивНомеровКолонок.Добавить(НомерКолонкиSKUТовараОстатков);
				МассивНомеровКолонок.Добавить(НомерКолонкиЦена);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлПриемник(Файл)
	
	ФайлВХранилище = ПоместитьВоВременноеХранилище(Файл);
	
	ФайлПриемник = ПолучитьИмяВременногоФайла(".xlsx");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(ФайлВХранилище);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	Возврат ФайлПриемник;
	
КонецФункции

&НаСервере
Процедура ЗавершениеЗагрузкиОшибкаНаСервере()
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Ошибка при загрузке данных. Подробное описание можно посмотреть в журнале регистрации";
	Сообщение.Сообщить();
	
	ЗаписьЖурналаРегистрации("Ошибка при загрузке данных", 
								УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
	
							КонецПроцедуры
							
&НаСервере
Функция ПроверитьУсловиеВыбораСклада()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс <> Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Если АккаунтМаркетплейса.СхемаРаботы = Перечисления.рар_мп_СхемыРаботы.FBO Тогда
			Возврат Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти   

#Область ФормированиеДанныхДляВводаВзаиморасчетов

&НаСервере
Процедура ДокОстатковЗаполнениеПолей(ДокОстатков)
	
	ДокОстатковНоменклатуры = ДокОстатков.Ссылка;
	
	Если ДокОстатковНоменклатуры.Проведен Тогда
		
		СуммаДокОстатков = ДокОстатковНоменклатуры.Товары.Итог("Сумма");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокОстатковНоменклатурыПриИзменении(Элемент) 
	
	Если ДокОстатковНоменклатуры.Пустая() Тогда
		
		СуммаДокОстатков = 0; 
		
	Иначе
		
		ДокОстатковЗаполнениеПолей(ДокОстатковНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
